//콘솔창을 띄운다.
//자동으로 붙게 되어있다.
//#include <iostream>

int main()
{
	// 이 안에 어떠한 내용을 적음으로 해서
	//게임이 만들어지게 되는 개념
	// 숫자를 하나 선언하는 방법에 대해서 알아보겠습니다.

	// 함수의 시작과 함수의 끝 사이를
	// 스코프 혹은 지역이라고 부릅니다.

	// 지역에 선언된 숫자
	// 지역에 선언된 메모리라고 합니다.

	10; // <- 이런 고정된 숫자를 상수라고 부릅니다.
	// 정의해 놨습니다. <= C++ 표준에서
	// 열거형
	// 사용자 정의 자료형
	// 정수형, 실수형, 논리형
	// 이런 형들에는 그것을 표현하기 위한 자료형이 있고,
	// 그 다음에 이름을 붙여주는 것이 기본입니다.

	// 자료형	이름
		int		Att;
		//int	Att: 한 번 더 선언 했을 때 안되는 이유가 똑같은 위치에 선언하겠다고 해서 안되는 것
	// 정수 Att를 만들어야 해.
	// 자료형이 표현하는 의미가 있고,
	// 이름이 표현하는 의미가 있게 됩니다.

	// 자료형의 의미
	// 1, 바이트 크기 int 는 4바이트
	// 2. 처리형태 <= 그리고 정수다.
		
	// 이름이 의미하는 것
	// 1. 위치 <= 내 프로그램의 시작위치에서 n(변수)바이트 떨어진 위치에 만들어진다.
	// <= 주소갑으로 치환된다. <+ 물리적인 램에서의 위치. 
	// 자료형의 값만큼 바이트를 사용하기 때문에 프로그램을 시작했을 때 램에서 프로그램의 크기가 커진다.


}